package poi.utils;

/**
 * セルの列名を取得する際の定数を提供するクラス。
 * @author ぺえぺえのうんこ
 */
public enum CellColumnName {

	A(0), B(1), C(2), D(3), E(4), F(5), G(6), H(7), I(8), J(9), K(10), L(11), M(12), N(13), O(14), P(15), Q(16), R(17), S(18), T(19), U(20), V(21), W(22), X(23), Y(24), Z(25), AA(26), AB(27), AC(28), AD(29), AE(30), AF(31), AG(32), AH(33), AI(34), AJ(35), AK(36), AL(37), AM(38), AN(39), AO(40), AP(41), AQ(42), AR(43), AS(44), AT(45), AU(46), AV(47), AW(48), AX(49), AY(50), AZ(51), BA(52), BB(53), BC(54), BD(55), BE(56), BF(57), BG(58), BH(59), BI(60), BJ(61), BK(62), BL(63), BM(64), BN(65), BO(66), BP(67), BQ(68), BR(69), BS(70), BT(71), BU(72), BV(73), BW(74), BX(75), BY(76), BZ(77), CA(78), CB(79), CC(80), CD(81), CE(82), CF(83), CG(84), CH(85), CI(86), CJ(87), CK(88), CL(89), CM(90), CN(91), CO(92), CP(93), CQ(94), CR(95), CS(96), CT(97), CU(98), CV(99), CW(100), CX(101), CY(102), CZ(103), DA(104), DB(105), DC(106), DD(107), DE(108), DF(109), DG(110), DH(111), DI(112), DJ(113), DK(114), DL(115), DM(116), DN(117), DO(118), DP(119), DQ(120), DR(121), DS(122), DT(123), DU(124), DV(125), DW(126), DX(127), DY(128), DZ(129), EA(130), EB(131), EC(132), ED(133), EE(134), EF(135), EG(136), EH(137), EI(138), EJ(139), EK(140), EL(141), EM(142), EN(143), EO(144), EP(145), EQ(146), ER(147), ES(148), ET(149), EU(150), EV(151), EW(152), EX(153), EY(154), EZ(155), FA(156), FB(157), FC(158), FD(159), FE(160), FF(161), FG(162), FH(163), FI(164), FJ(165), FK(166), FL(167), FM(168), FN(169), FO(170), FP(171), FQ(172), FR(173), FS(174), FT(175), FU(176), FV(177), FW(178), FX(179), FY(180), FZ(181), GA(182), GB(183), GC(184), GD(185), GE(186), GF(187), GG(188), GH(189), GI(190), GJ(191), GK(192), GL(193), GM(194), GN(195), GO(196), GP(197), GQ(198), GR(199), GS(200), GT(201), GU(202), GV(203), GW(204), GX(205), GY(206), GZ(207), HA(208), HB(209), HC(210), HD(211), HE(212), HF(213), HG(214), HH(215), HI(216), HJ(217), HK(218), HL(219), HM(220), HN(221), HO(222), HP(223), HQ(224), HR(225), HS(226), HT(227), HU(228), HV(229), HW(230), HX(231), HY(232), HZ(233), IA(234), IB(235), IC(236), ID(237), IE(238), IF(239), IG(240), IH(241), II(242), IJ(243), IK(244), IL(245), IM(246), IN(247), IO(248), IP(249), IQ(250), IR(251), IS(252), IT(253), IU(254), IV(255), 	
	;
	
	private int value;

	private CellColumnName(int n) {
		this.value = n;
	}

	public int getValue() {
		return this.value;
	}
	
}
